## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| update   | `aws_iam_policy.ecr`                              |
|          | `aws_lambda_alias.api_latest`                     |
|          | `aws_lambda_function.api`                         |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
18:47:56.573 STDOUT terraform:   ~ update in-place
18:47:56.573 STDOUT terraform: -/+ destroy and then create replacement
18:47:56.573 STDOUT terraform:  <= read (data resources)
18:47:56.574 STDOUT terraform: Terraform will perform the following actions:
18:47:56.574 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
18:47:56.574 STDOUT terraform:   # (depends on a resource or a module with changes pending)
18:47:56.574 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
18:47:56.574 STDOUT terraform:       + id            = (known after apply)
18:47:56.574 STDOUT terraform:       + json          = (known after apply)
18:47:56.574 STDOUT terraform:       + minified_json = (known after apply)
18:47:56.574 STDOUT terraform:       + statement {
18:47:56.574 STDOUT terraform:           + actions   = [
18:47:56.574 STDOUT terraform:               + "ecr:GetAuthorizationToken",
18:47:56.574 STDOUT terraform:             ]
18:47:56.574 STDOUT terraform:           + effect    = "Allow"
18:47:56.574 STDOUT terraform:           + resources = [
18:47:56.574 STDOUT terraform:               + "*",
18:47:56.574 STDOUT terraform:             ]
18:47:56.574 STDOUT terraform:           + sid       = "GetAuthorizationToken"
18:47:56.574 STDOUT terraform:         }
18:47:56.574 STDOUT terraform:       + statement {
18:47:56.574 STDOUT terraform:           + actions   = [
18:47:56.574 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
18:47:56.574 STDOUT terraform:               + "ecr:BatchGetImage",
18:47:56.574 STDOUT terraform:               + "ecr:CompleteLayerUpload",
18:47:56.574 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
18:47:56.574 STDOUT terraform:               + "ecr:InitiateLayerUpload",
18:47:56.574 STDOUT terraform:               + "ecr:PutImage",
18:47:56.574 STDOUT terraform:               + "ecr:UploadLayerPart",
18:47:56.574 STDOUT terraform:             ]
18:47:56.574 STDOUT terraform:           + effect    = "Allow"
18:47:56.574 STDOUT terraform:           + resources = [
18:47:56.574 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
18:47:56.574 STDOUT terraform:             ]
18:47:56.574 STDOUT terraform:           + sid       = "AllowPushPull"
18:47:56.574 STDOUT terraform:         }
18:47:56.574 STDOUT terraform:       + statement {
18:47:56.574 STDOUT terraform:           + actions   = [
18:47:56.574 STDOUT terraform:               + "lambda:GetAlias",
18:47:56.574 STDOUT terraform:               + "lambda:GetFunction",
18:47:56.574 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
18:47:56.574 STDOUT terraform:               + "lambda:ListAliases",
18:47:56.574 STDOUT terraform:               + "lambda:ListVersionsByFunction",
18:47:56.574 STDOUT terraform:               + "lambda:PublishVersion",
18:47:56.574 STDOUT terraform:               + "lambda:UpdateAlias",
18:47:56.575 STDOUT terraform:               + "lambda:UpdateFunctionCode",
18:47:56.575 STDOUT terraform:             ]
18:47:56.575 STDOUT terraform:           + effect    = "Allow"
18:47:56.575 STDOUT terraform:           + resources = [
18:47:56.575 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
18:47:56.575 STDOUT terraform:             ]
18:47:56.575 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
18:47:56.575 STDOUT terraform:         }
18:47:56.575 STDOUT terraform:       + statement {
18:47:56.575 STDOUT terraform:           + actions   = [
18:47:56.575 STDOUT terraform:               + "lambda:GetLayerVersion",
18:47:56.575 STDOUT terraform:             ]
18:47:56.575 STDOUT terraform:           + effect    = "Allow"
18:47:56.575 STDOUT terraform:           + resources = [
18:47:56.575 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
18:47:56.575 STDOUT terraform:             ]
18:47:56.575 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
18:47:56.575 STDOUT terraform:         }
18:47:56.575 STDOUT terraform:     }
18:47:56.575 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
18:47:56.575 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
18:47:56.575 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
18:47:56.575 STDOUT terraform:         name             = "ecr-api-lambda-access"
18:47:56.575 STDOUT terraform:       ~ policy           = jsonencode(
18:47:56.575 STDOUT terraform:             {
18:47:56.575 STDOUT terraform:               - Statement = [
18:47:56.575 STDOUT terraform:                   - {
18:47:56.575 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
18:47:56.575 STDOUT terraform:                       - Effect   = "Allow"
18:47:56.575 STDOUT terraform:                       - Resource = "*"
18:47:56.575 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
18:47:56.575 STDOUT terraform:                     },
18:47:56.575 STDOUT terraform:                   - {
18:47:56.575 STDOUT terraform:                       - Action   = [
18:47:56.575 STDOUT terraform:                           - "ecr:UploadLayerPart",
18:47:56.575 STDOUT terraform:                           - "ecr:PutImage",
18:47:56.575 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
18:47:56.575 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
18:47:56.575 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
18:47:56.575 STDOUT terraform:                           - "ecr:BatchGetImage",
18:47:56.575 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
18:47:56.575 STDOUT terraform:                         ]
18:47:56.575 STDOUT terraform:                       - Effect   = "Allow"
18:47:56.576 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
18:47:56.576 STDOUT terraform:                       - Sid      = "AllowPushPull"
18:47:56.576 STDOUT terraform:                     },
18:47:56.576 STDOUT terraform:                   - {
18:47:56.576 STDOUT terraform:                       - Action   = [
18:47:56.576 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
18:47:56.576 STDOUT terraform:                           - "lambda:UpdateAlias",
18:47:56.576 STDOUT terraform:                           - "lambda:PublishVersion",
18:47:56.576 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
18:47:56.576 STDOUT terraform:                           - "lambda:ListAliases",
18:47:56.576 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
18:47:56.576 STDOUT terraform:                           - "lambda:GetFunction",
18:47:56.576 STDOUT terraform:                           - "lambda:GetAlias",
18:47:56.576 STDOUT terraform:                         ]
18:47:56.576 STDOUT terraform:                       - Effect   = "Allow"
18:47:56.576 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
18:47:56.576 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
18:47:56.576 STDOUT terraform:                     },
18:47:56.576 STDOUT terraform:                   - {
18:47:56.576 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
18:47:56.576 STDOUT terraform:                       - Effect   = "Allow"
18:47:56.576 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
18:47:56.576 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
18:47:56.576 STDOUT terraform:                     },
18:47:56.576 STDOUT terraform:                 ]
18:47:56.576 STDOUT terraform:               - Version   = "2012-10-17"
18:47:56.576 STDOUT terraform:             }
18:47:56.576 STDOUT terraform:         ) -> (known after apply)
18:47:56.576 STDOUT terraform:         tags             = {}
18:47:56.576 STDOUT terraform:         # (7 unchanged attributes hidden)
18:47:56.576 STDOUT terraform:     }
18:47:56.576 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
18:47:56.576 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
18:47:56.576 STDOUT terraform:       ~ function_version = "1721" -> (known after apply)
18:47:56.576 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
18:47:56.576 STDOUT terraform:         name             = "latest"
18:47:56.576 STDOUT terraform:         # (5 unchanged attributes hidden)
18:47:56.577 STDOUT terraform:     }
18:47:56.577 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
18:47:56.577 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
18:47:56.577 STDOUT terraform:         id                             = "api-lambda"
18:47:56.577 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1721" -> (known after apply)
18:47:56.577 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1721/invocations" -> (known after apply)
18:47:56.577 STDOUT terraform:         tags                           = {}
18:47:56.577 STDOUT terraform:       ~ version                        = "1721" -> (known after apply)
18:47:56.577 STDOUT terraform:         # (27 unchanged attributes hidden)
18:47:56.577 STDOUT terraform:       ~ environment {
18:47:56.577 STDOUT terraform:           ~ variables = {
18:47:56.577 STDOUT terraform:               ~ "NEW_RELIC_APP_NAME"                    = "notification-api-staging" -> "notification-lambda-api-staging"
18:47:56.577 STDOUT terraform:               - "NEW_RELIC_LICENSE_KEY"                 = "460a1eddc146dc051d9c3e6f4b6702d0FFFFNRAL" -> null
18:47:56.577 STDOUT terraform:                 # (18 unchanged elements hidden)
18:47:56.577 STDOUT terraform:             }
18:47:56.577 STDOUT terraform:         }
18:47:56.577 STDOUT terraform:         # (4 unchanged blocks hidden)
18:47:56.577 STDOUT terraform:     }
18:47:56.577 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
18:47:56.577 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
18:47:56.577 STDOUT terraform:       ~ id       = "206422844654225035" -> (known after apply)
18:47:56.577 STDOUT terraform:       ~ triggers = { # forces replacement
18:47:56.577 STDOUT terraform:           ~ "always_run" = "2025-09-18T19:55:38Z" -> (known after apply)
18:47:56.577 STDOUT terraform:         }
18:47:56.577 STDOUT terraform:     }
18:47:56.577 STDOUT terraform: Plan: 1 to add, 3 to change, 1 to destroy.
18:47:56.577 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:47:56.577 STDOUT terraform: Saved the plan to: plan.tfplan
18:47:56.577 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:47:56.577 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
